package pconstants

const (
	SUCCESS_CODE = 0    //success
	ERROR_CODE   = -1   //failed
	ERROR_1001   = 1001 //签名失效
	ERROR_1002   = 1002 //签名错误
	ERROR_2001   = 2001 //数据记录不存在
	ERROR_2002   = 2002 //数据重复
	ERROR_2003   = 2003 //操作失败
	ERROR_3000   = 3000 //参数验证不合规
	ERROR_3001   = 3001 //操作过于频繁请稍后再试
	ERROR_3002   = 3002 //无操作权限请联系管理员
	ERROR_3003   = 3003 //上传失败
	ERROR_3004   = 3004 //数据格式不正确
	ERROR_3005   = 3005 //数据填写内容值不合规
	ERROR_3054   = 3054 //系统繁忙,请稍后再试
	ERROR_9000   = 9000 //账户授权Token值已过期请重新获取
	ERROR_9001   = 9001 //账户被禁用请联系管理员
	ERROR_9002   = 9002 //账号/密码错误请检查后重试
	ERROR_9003   = 9003 //账号已存在
	ERROR_9004   = 9004 //账号/密码错误请检查后重试
	ERROR_9005   = 9005 //密码错误次数过多请稍后再试
	ERROR_9006   = 9006 //账户信息异常
)

// 定义编码对应的默认说明文案集合
var Jsoncode = map[int]string{
	SUCCESS_CODE: "success",
	ERROR_CODE:   "failed",
	ERROR_1001:   "签名失效",
	ERROR_1002:   "签名错误",
	ERROR_2001:   "数据记录不存在",
	ERROR_2002:   "数据重复",
	ERROR_2003:   "操作失败",
	ERROR_3000:   "参数验证不合规",
	ERROR_3001:   "操作过于频繁请稍后再试",
	ERROR_3002:   "无操作权限请联系管理员",
	ERROR_3003:   "上传失败",
	ERROR_3004:   "数据格式不正确",
	ERROR_3005:   "数据填写内容值不合规",
	ERROR_3054:   "系统繁忙,请稍后再试",
	ERROR_9000:   "账户授权Token值已过期请重新获取",
	ERROR_9001:   "账户被禁用请联系管理员",
	ERROR_9002:   "账号/密码错误请检查后重试",
	ERROR_9003:   "账号已存在",
	ERROR_9004:   "账号/密码错误请检查后重试",
	ERROR_9005:   "密码错误次数过多请稍后再试",
	ERROR_9006:   "账户信息异常",
}
